import java.util.Scanner;
//Б) З використанням повної форми оператора розгалуження if ... else:

public class Main {
    public static void main(String[] args) {
        // Створення об'єкту Scanner для отримання введених користувачем даних
        Scanner scanner = new Scanner(System.in);

        // Повідомлення користувачеві для введення цілого числа 'a'
        System.out.println("ціле число a:");
        // Зчитування введеного користувачем цілого числа 'a'
        int a = scanner.nextInt();

        // Повідомлення користувачеві для введення дійсного числа 'c'
        System.out.println("дійсне число c:");
        // Зчитування введеного користувачем дійсного числа 'c'
        double c = scanner.nextDouble();

        // Оголошення змінної 'b', яка буде зберігати результат обчислення
        double b;

        // Перевірка умов, за яких обчислення неможливе
        if (a == 0 || (Math.pow(a, 2) - 4 * c) == 0 || a * c < 0) {
            // Виведення повідомлення про неможливість обчислення результату
            System.out.println("Неможливо обчислити вираз");
        } else {
            // Обчислення результату за формулою, якщо всі умови виконані
            b = (Math.pow(a, 2) - 4 * c) / (a * c);
            // Виведення результату обчислення
            System.out.println("Результат обчислення: " + b);
        }
    }
}